<template>
  <div>
    <h1>Биография Джозефа Джостара</h1>
    <p>Джозеф Джостар, родившийся в 1920 году, является британско-американским авантюристом и главным героем второй части серии JoJo's Bizarre Adventure, Battle Tendency. Он известен своей сообразительностью, остроумием и мастерством в технике Ripple. Джозеф — внук Джонатана Джостара и отец Холли Куджо. На протяжении своей жизни он сталкивался с многочисленными сверхъестественными угрозами, включая Людей-столпов и вампира Дио Брандо. Приключения Джозефа охватывают весь мир, от Нью-Йорка до Италии и даже Египта, где он играет ключевую роль в окончательном поражении Дио. Его наследие продолжается через его потомков, которые продолжают традицию семьи Джостаров в борьбе со злом.</p>
  </div>
</template> 

<script>
export default {
  name: 'Biography'
};
</script>

<style scoped>
/* Add styles here */
</style> 