<template>
  <div>
    <h1>Генеалогия семьи Джостаров</h1>
    <p>Семья Джостаров — это благородная и влиятельная семья с долгой историей борьбы с сверхъестественными силами. Родословная начинается с Джорджа Джостара I, который усыновил молодого Дио Брандо, что запустило цепь событий, повлиявших на поколения. Джонатан Джостар, первый ДжоДжо, сражался против Дио и его вампирских амбиций. Его внук, Джозеф Джостар, продолжил борьбу со злом, сталкиваясь с Людьми-столпами и позже с возвращением Дио. Дочь Джозефа, Холли Куджо, родила Джотаро Куджо, который стал главным героем третьей части, Stardust Crusaders. Наследие семьи продолжается с Джоске Хигашиката, Джорно Джованна и Джолин Куджо, каждый из которых сталкивается с уникальными вызовами и противниками. Кровная линия Джостаров отмечена мужеством, стойкостью и неустанным стремлением к справедливости.</p>
  </div>
</template> 

<script>
export default {
  name: 'Genealogy'
};
</script>

<style scoped>
/* Add styles here */
</style> 